app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(gossip_params)
    if @gossip.save
---
INSERT INTO "gossips" ("anonymous_author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["anonymous_author", "s"], ["content", "d"], ["created_at", "2018-01-31 15:28:08.753034"], ["updated_at", "2018-01-31 15:28:08.753034"]]

  def update
  @gossip = Gossip.find(params[:id])

  if @gossip.update(gossip_params)
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "anonymous_author" = ?, "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["anonymous_author", "This is a try"], ["content", "noooop"], ["updated_at", "2018-01-31 15:57:55.068647"], ["id", 1]]